{
  "title": "Climate metadata",
  "text": "",
  "subsections": [
    "5.5.1"
  ],
  "copyright": "World Meteorological Organization, 2014",
  "reference": "WMO-No. 1131",
  "version": "1.0",
  "5.5.1": {
    "title": "Manage climate metadata",
    "text": "This subsection refers to the processes, software, governance mechanisms and data analysis required to effectively manage climate metadata, which include metadata on observations, discovery and data provenance.\n\nNote: This subsection is deliberately kept generic in this version of the CDMS Specifications, with all types of climate metadata bundled together. While the Create and Maintain components (5.5.1.1 and 5.5.1.2, respectively) are classified as recommended, in reality data provenance metadata has not yet been adequately defined. Therefore, a pragmatic approach would rightly not address the creation and maintenance of data provenance metadata until this has been rectified. The creation and maintenance of discovery and observations metadata, however, is required.\n\nFor more information on climate metadata, see section 4.3 of this publication.",
    "components": [
      "5.5.1.1",
      "5.5.1.2",
      "5.5.1.3",
      "5.5.1.4"
    ],
    "5.5.1.1": {
      "title": "Create",
      "text": "This component refers to the processes, software and governance processes needed to effectively and efficiently create climate metadata.",
      "classification": "Recommended"
    },
    "5.5.1.2": {
      "title": "Maintain",
      "text": "This component covers the processes, software and governance mechanisms required to effectively and efficiently maintain climate metadata.",
      "classification": "Recommended"
    },
    "5.5.1.3": {
      "title": "Quality control",
      "text": "This component deals with the processes, software and governance processes needed to effectively and efficiently assess and control the quality of climate metadata.\n\nMore work is required to provide effective guidance on this component.",
      "classification": "Recommended"
    },
    "5.5.1.4": {
      "title": "Metrics",
      "text": "This component refers to the processes, software and governance processes required to effectively and efficiently maintain metrics relevant to climate metadata.\n\nSome examples are:\n1. Which stations or sensors do not have observations metadata records?\n2. Which datasets do not have discovery metadata records?\n\nMore work is required to provide effective guidance on this component.",
      "classification": "Recommended"
    }
  }
}